In [1]:
import numpy as np
import pandas as pd

In [2]:
# create list

list1 = [1,2,3,4]
list2 = [-1,-2,-3,-4]
list3 = [ list1, list2  ]
print(list3)

[[1, 2, 3, 4], [-1, -2, -3, -4]]

In [3]:
# ar_list1 =  array("i", list1)  # doesnt work

In [4]:
# list to array

array1 = np.array(list1)
print(array1)

[1 2 3 4]

In [5]:
print(sum(array1))
print(array1[0])

10
1

In [6]:
dimArray = np.array( list3 )

In [7]:
print ( dimArray )

[[ 1  2  3  4]
 [-1 -2 -3 -4]]

In [8]:
print( dimArray[1][0] )

-1

In [9]:
#increrment all by 1
dimArray = dimArray +1

In [10]:
# list to series ( with default index )
print ( pd.Series(list1) )

# array to series also works 
print ( pd.Series(array1) )

0    1
1    2
2    3
3    4
dtype: int64
0    1
1    2
2    3
3    4
dtype: int32

In [11]:
# Series with explicit index
#print ( pd.Series(array1, index=['zero', 'one', 'two', 'three']) )

indexedSeries = pd.Series(array1, index=['zero', 'one', 'two', 'three'])

In [12]:
print(indexedSeries)

zero     1
one      2
two      3
three    4
dtype: int32

In [13]:


df = pd.DataFrame([
  ['January', 100, 100, 23, 100],
  ['February', 51, 45, 145, 45],
  ['March', 81, 96, 65, 96],
  ['April', 80, 80, 54, 180],
  ['May', 51, 54, 54, 154],
  ['June', 112, 109, 79, 129]],
  columns=['month', 'clinic_east',
           'clinic_north', 'clinic_south',
           'clinic_west']
)

In [14]:
print(df)

      month  clinic_east  clinic_north  clinic_south  clinic_west
0   January          100           100            23          100
1  February           51            45           145           45
2     March           81            96            65           96
3     April           80            80            54          180
4       May           51            54            54          154
5      June          112           109            79          129

In [15]:
# slice rows : these give the same output

print(df[1:3])
print(df.iloc[1:3])

      month  clinic_east  clinic_north  clinic_south  clinic_west
1  February           51            45           145           45
2     March           81            96            65           96
      month  clinic_east  clinic_north  clinic_south  clinic_west
1  February           51            45           145           45
2     March           81            96            65           96

In [16]:
# slice rows : these also give the same output

print(df[ 3: ])
print(df[ -3: ])

   month  clinic_east  clinic_north  clinic_south  clinic_west
3  April           80            80            54          180
4    May           51            54            54          154
5   June          112           109            79          129
   month  clinic_east  clinic_north  clinic_south  clinic_west
3  April           80            80            54          180
4    May           51            54            54          154
5   June          112           109            79          129

In [17]:
# try skip step 
## [ start : end : interval ] 

df[0:4:2] # doesnt work with a straight slice
#df.iloc[0:4]

     month  clinic_east  clinic_north  clinic_south  clinic_west
0  January          100           100            23          100
2    March           81            96            65           96

In [18]:
# instruction

april_may_june = df[ 3: ]

april_may_june

   month  clinic_east  clinic_north  clinic_south  clinic_west
3  April           80            80            54          180
4    May           51            54            54          154
5   June          112           109            79          129

In [19]:
#########
## Select with conditions
###############

In [20]:
df = pd.DataFrame([
  ['January', 100, 100, 23, 100],
  ['February', 51, 45, 145, 45],
  ['March', 81, 96, 65, 96],
  ['April', 80, 80, 54, 180],
  ['May', 51, 54, 54, 154],
  ['June', 112, 109, 79, 129]],
  columns=['month', 'clinic_east',
           'clinic_north', 'clinic_south',
           'clinic_west'])

In [21]:
#df

In [22]:
# lambda refresher

f = lambda n : n * 5
f(3)

15

In [23]:
# select WHERE, single condition
# df[ df.column <op> condition ]

df[ df.clinic_east > 51 ]

     month  clinic_east  clinic_north  clinic_south  clinic_west
0  January          100           100            23          100
2    March           81            96            65           96
3    April           80            80            54          180
5     June          112           109            79          129

In [24]:
## instruction
# Create variable january using a logical statement that selects the row of df where the 'month' column is 'January'. 

january = df[ df.month ==  'January' ]

In [25]:
# select WHERE, multiple conditions
# df[  ( df.column <op> condition )  |/& ( df.column <op> condition ) ]
## * for more than 2 conditions, AND (&) is evaluated before OR (|)

In [26]:
## instruction
# Create the variable march_april, which contains the data from March and April. Do this using two logical statements combined using |, which means “or”.

march_april = df[ ( df.month == 'March' ) | ( df.month == 'April' ) ]

print(march_april)

   month  clinic_east  clinic_north  clinic_south  clinic_west
2  March           81            96            65           96
3  April           80            80            54          180

In [27]:
# select WHERE, using ISIN

# df[df.<column>.isin([value, value, value])]

In [28]:
df[df.clinic_east.isin([80, 81])]

   month  clinic_east  clinic_north  clinic_south  clinic_west
2  March           81            96            65           96
3  April           80            80            54          180

In [29]:
## instruction
# Create the variable january_february_march, containing the data from January, February, and March. Do this using a single logical statement with the isin command.

january_february_march = df[df.month.isin(['January', 'February', 'March'])]

print(january_february_march)

      month  clinic_east  clinic_north  clinic_south  clinic_west
0   January          100           100            23          100
1  February           51            45           145           45
2     March           81            96            65           96

In [30]:
# Reset index on extracted slice

In [31]:
df[ df.clinic_east == 51 ]

# notice the index 1,4 is fragmented

      month  clinic_east  clinic_north  clinic_south  clinic_west
1  February           51            45           145           45
4       May           51            54            54          154

In [32]:
df[ df.clinic_east == 51 ].reset_index()

# FIXED, sorta, though old values remain in a new column, index

   index     month  clinic_east  clinic_north  clinic_south  clinic_west
0      1  February           51            45           145           45
1      4       May           51            54            54          154

In [33]:
df[ df.clinic_east == 51 ].reset_index( drop = True )  # drop = True removes the old index values

      month  clinic_east  clinic_north  clinic_south  clinic_west
0  February           51            45           145           45
1       May           51            54            54          154

In [34]:
# Note, both these operations create a new dataframe with the result set. 'df' is not effected.
#df

In [35]:
# use inplace=True to modify a dataframe in place

df[ df.clinic_east < 80 ].reset_index(inplace=True   )

In [36]:
df

      month  clinic_east  clinic_north  clinic_south  clinic_west
0   January          100           100            23          100
1  February           51            45           145           45
2     March           81            96            65           96
3     April           80            80            54          180
4       May           51            54            54          154
5      June          112           109            79          129

In [37]:
# New method :: loc[] to access rows
df.loc[[1, 3, 5]]

#df.loc[[1, 3, 5]].reset_index()

      month  clinic_east  clinic_north  clinic_south  clinic_west
1  February           51            45           145           45
3     April           80            80            54          180
5      June          112           109            79          129

In [38]:
df2 = df.loc[[1, 3, 5]]
df2

      month  clinic_east  clinic_north  clinic_south  clinic_west
1  February           51            45           145           45
3     April           80            80            54          180
5      June          112           109            79          129

In [39]:
## instruction
# Create a new DataFrame called df3 by resetting the indices on df2 (don’t use inplace or drop). Did df2 change after you ran this command?

df3 = df2.reset_index()
df3

   index     month  clinic_east  clinic_north  clinic_south  clinic_west
0      1  February           51            45           145           45
1      3     April           80            80            54          180
2      5      June          112           109            79          129

In [40]:
# Reset the indices of df2 by using the keyword inplace=True and drop=True. Did the indices of df2 change? How is df2 different from df3?

df2.reset_index(drop=True, inplace=True)
df2

      month  clinic_east  clinic_north  clinic_south  clinic_west
0  February           51            45           145           45
1     April           80            80            54          180
2      June          112           109            79          129

In [41]:
###
#  Excursion : using reset_index() to force a numeric index on a df that has been indexed on another non-numeric column
####

#df_networkProject = pd.read_csv('Nodes_IN_Medium.csv')

In [42]:
#type(df_networkProject)
#df_networkProject.head(5)

In [43]:
# set the df index to nodename

#df_networkProject.set_index('nodename', inplace = True)

In [44]:
# now reset the index

#df_networkProject.reset_index(inplace=True)

# WORKS!

In [45]:
####################
# Exercise
#################

#In this example, you’ll be the data analyst for ShoeFly.com, a fictional online shoe store. You’ve seen this data; now it’s your turn to work with it!

In [46]:
# Load the data from shoefly.csv into the variable orders 

#orders = pd.read_csv('shoefly.csv')

In [47]:
# Inspect the first 5 lines of the data.

#orders.head(5) # no good; Excel didnt parse it; its all in 1 column... FIXED

In [48]:
# Select all of the email addresses from the column email and save them to a variable called emails

#orders['email']

In [49]:
# Frances Palmer claims that her order was wrong. What did Frances Palmer order? Use logic to select that row of orders and save it to the variable frances_palmer

#frances_palmer = orders[ ( orders.first_name  == 'Frances' ) & ( orders.last_name == 'Palmer'  )  ]
#print(type(frances_palmer))  # even this single line result is of type data frame
#frances_palmer

In [50]:
# We need some customer reviews for our comfortable shoes. Select all orders for shoe_type: clogs, boots, and ballet flats and save them to the variable comfy_shoes.

#comfy_shoes = orders[ orders.shoe_type.isin(  [ 'clogs', 'boots', 'ballet flats' ] ) ]

#print( comfy_shoes )
#comfy_shoes

In [51]:
##############
# Modifying a DataFrame
#################

In [52]:
## Adding a Column I

In [53]:
df = pd.DataFrame([
  [1, '3 inch screw', 0.5, 0.75],
  [2, '2 inch nail', 0.10, 0.25],
  [3, 'hammer', 3.00, 5.50],
  [4, 'screwdriver', 2.50, 3.00]
],
  columns=['Product ID', 'Description', 'Cost to Manufacture', 'Price']
)

In [54]:
# The DataFrame df contains information on products sold at a hardware store. Add a column to df called 'Sold in Bulk?', which indicates if the product is sold in bulk or individually. The final table should look like this:

In [55]:
df['Sold in Bulk?'] = [ 'Yes', 'Yes', 'No', 'No' ]

In [56]:
# Add a column to df called Is taxed?, which indicates whether or not to collect sales tax on the product. It should be 'Yes' for all rows.

In [57]:
df['Is taxed?'] = 'Yes'

In [58]:
## Using apply() to modify a column

df['Is taxed?'] = df["Is taxed?"].apply(str.upper) # dot . notation can be used to designate columns by exact name , only w/o whitespace

In [59]:
## Instruction: Apply the function lower to all names in column 'Name' in df. Assign these new names to a new column of df called 'Lowercase Name'. 

df2 = pd.DataFrame([
  ['JOHN SMITH', 'john.smith@gmail.com'],
  ['Jane Doe', 'jdoe@yahoo.com'],
  ['joe schmo', 'joeschmo@hotmail.com']
],
columns=['Name', 'Email'])

In [60]:
df2['Lowercase Name'] = df2['Name'].apply(str.lower)

In [61]:
df2

         Name                 Email Lowercase Name
0  JOHN SMITH  john.smith@gmail.com     john smith
1    Jane Doe        jdoe@yahoo.com       jane doe
2   joe schmo  joeschmo@hotmail.com      joe schmo

In [62]:
## Modifying a data frame with lambdas

In [63]:
## Instruction : Create a lambda function mylambda that returns the first and last letters of a string, assuming the string is at least 2 characters long. For example,

mylambda = lambda str :  str[0] + str[-1] if len(str) > 1 else 'too short, shorty!'

In [64]:
mylambda('E')

'too short, shorty!'

In [65]:
# Cool use of apply() with a lambda
df2['NameFirstAndLast'] = df2.Name.apply(mylambda)

In [66]:
df2

         Name                 Email Lowercase Name NameFirstAndLast
0  JOHN SMITH  john.smith@gmail.com     john smith               JH
1    Jane Doe        jdoe@yahoo.com       jane doe               Je
2   joe schmo  joeschmo@hotmail.com      joe schmo               jo

In [67]:
## Instruction: You are managing the webpage of a somewhat violent video game and you want to check that each user’s age is 13 or greater when they visit the site.
#Write a lambda function that takes an inputted age and either returns Welcome to BattleCity! bif the user is 13 or older or You must be 13 or older if they are younger than 13. Your lambda function should be called mylambda.


mylambda = lambda age : 'Welcome to BattleCity!' if age >= 13 else 'You must be 13 or older'

In [68]:
mylambda(11)

'You must be 13 or older'

In [69]:
## Instruction: Create a lambda function get_last_name which takes a string with someone’s first and last name (i.e., John Smith), and returns just the last name (i.e., Smith).

In [70]:
get_last_name = lambda fName : fName.split(' ')[-1]

In [71]:
get_last_name('Eric Smyth')

'Smyth'

In [72]:

## Instruction: Use the lambda function get_last_name to create a new column last_name with only the employees’ last name.
df = pd.DataFrame([
  [1, '3 inch screw', 0.5, 0.75],
  [2, '2 inch nail', 0.10, 0.25],
  [3, 'hammer', 3.00, 5.50],
  [4, 'screwdriver', 2.50, 3.00]
],
  columns=['Product ID', 'Description', 'Cost to Manufacture', 'Price']
)

#df[]

In [73]:
df['Is taxed?'] = [True, False, False, True]

In [74]:
df['Price with Tax'] = df.apply(lambda row:
     round(row['Price'] * 1.075, 2)
     if row['Is taxed?'] == True
     else round(row['Price'], 2),
     axis=1
)

In [75]:
# use this repeatedly where payroll data is needed
# The DataFrame df represents the hours worked by different employees over the course of the week. It contains the following columns:

df = pd.read_csv( '../employees.csv' )

In [76]:
df['last_name'] = df.name.apply( get_last_name) ### dont pass an empty () when calling a lambda; pass nothing

In [77]:
df

       id               name  hourly_wage  hours_worked  last_name
0   10310      Lauren Durham           19            43     Durham
1   18656      Grace Sellers           17            40    Sellers
2   61254  Shirley Rasmussen           16            30  Rasmussen
3   16886        Brian Rojas           18            47      Rojas
4   89010    Samantha Mosley           11            38     Mosley
5   87246       Louis Guzman           14            39     Guzman
6   20578     Denise Mcclure           15            40    Mcclure
7   12869      James Raymond           15            32    Raymond
8   53461       Noah Collier           18            35    Collier
9   14746    Donna Frederick           20            41  Frederick
10  71127       Shirley Beck           14            32       Beck
11  92522    Christina Kelly            8            44      Kelly
12  22447        Brian Noble           11            39      Noble
13  61654          Randy Key           16            38        Key
14  16988      Diana Stewart           14            48    Stewart
15  68619       Timothy Sosa           14            42       Sosa
16  59949      Betty Skinner           11            48    Skinner
17  81418      Janet Maxwell           12            38    Maxwell
18  27267   Madison Johnston           20            37   Johnston
19  19985   Virginia Nichols           13            49    Nichols

In [78]:
############
## Applying a Lambda to a Row ( use axis = 1 ) - this is for conditional updates , i.e. WHERE
#############
#We can also operate on multiple columns at once. If we use apply without specifying a single column and add the argument axis=1, the input to our lambda function will be an entire row, not a column. To access particular values of the row, we use the syntax row.column_name or row[‘column_name’].

# df2 = df.apply( lambda row : row['Gravy'] = True if row['Cost to Manufacture'] < 0.9 else row['Gravy'] = False, axis = 1 ) # broken

In [79]:
# ... but how is this different from

calcPriceWithTax = lambda price : round(row['Price'] * 1.075, 2) if df['Is taxed']  == True else round(row['Price'], 2)

# df[ 'Price with Tax by Column' ] = df.apply( calcPriceWithTax  ) ## this doesnt work
#df[ 'Price with Tax by Column' ] = df.apply( lambda cell :   )

In [80]:
# Task: If an employee worked for more than 40 hours, she needs to be paid overtime (1.5 times the normal hourly wage).

# For instance, if an employee worked for 43 hours and made $10/hour, she would receive $400 for the first 40 hours that she worked, and an additional $45 for the 3 hours of overtime, for a total for $445.

# Create a lambda function total_earned that accepts an input row with keys hours_worked and hourly_wage and uses an if statement to calculate the total wages earned.



#total_earned = lambda row :  int( ( row.hours_worked - 40)  ) * int( ( row.hourly_wage * 1.5 ) ) +  ( int( ( row.hourly_wage * 40)  ) )  if int(row.hours_worked) > 40 else int ( row.hours_worked)  *  int(row.hourly_wage )

### This is the model function to use ; the int() conversions are only needed when using incorrect df[0:1] reference
total_earned = lambda row :   ( row.hours_worked - 40)   *  ( row.hourly_wage * 1.5 )  +  ( ( row.hourly_wage * 40)  )   if row.hours_worked > 40 else row.hours_worked  *  row.hourly_wage

#total_earned = lambda row :  int( ( row.hours_worked - 40)  ) * int( ( row.hourly_wage * 1.5 ) ) +  ( int( ( row.hourly_wage * 40)  ) )  if int(row.hours_worked) > 40 else int (  ( row.hours_worked)  *  int(row.hourly_wage ))

In [81]:
row1 = df.iloc[3]

print(row1)

total_earned(row1)

#print( df[1] )

#total_earned( { hours_worked : 1,  hourly_wage : 10 } )    

## calc 760 base pay , 85.5 PT

id                    16886
name            Brian Rojas
hourly_wage              18
hours_worked             47
last_name             Rojas
Name: 3, dtype: object

909.0

In [82]:
##  id           name  hourly_wage  hours_worked
## 10310  Lauren Durham           19            43

# base pay: 40 hr @ 19.00 = 760.00 
# OT : 3 hr @ 28.50 = 85.50 
# total : 845.5

In [83]:
# type(row1)
# row1.hours_worked *  ( row1.hourly_wage * 1.5 )
# row1.hours_worked *  row1.hourly_wage
# result = row1.hours_worked *  row1.hourly_wage
# #type( int(result) )
# int(result)

In [84]:
# lambda not working; try a fn
## Solution : row.hours_worked and row.hourly_wage return as SERIES; must be converted into ints for use in calc

# def total_earned( row ):
#     #return( row.hours_worked )
#     if int(row.hours_worked) > 40:
        
#          #return( 'OT' )
#         return(  int(row.hours_worked) * 40 + (  ))
#     else:
#          return( 'straight pay' )

In [85]:
total_earned( row1 )

909.0

In [86]:
# Use the lambda function total_earned and apply to add a column total_earned to df with the total amount earned by each employee.

df['total_earned'] = df.apply( total_earned, axis = 1 )

In [87]:
#df['Taxable?'] = [True, False, False, True] 
#df

In [88]:
##### 
# Renaming columns
#########

#You can change all of the column names at once by setting the .columns property to a different list. This is great when you need to change all of the column names at once, but be careful! You can easily mislabel columns if you get the ordering wrong. Here’s an example:

df = pd.DataFrame({
    'name': ['John', 'Jane', 'Sue', 'Fred'],
    'age': [23, 29, 21, 18]
})
df.columns = ['First Name', 'Age']

In [ ]:
## Instruction : The DataFrame df contains data about movies from IMDb.

# We want to present this data to some film producers. Right now, our column names are in lower case, and are not very descriptive. Let’s modify df using the .columns attribute to make the following changes to the columns:

# Old	New
# id	ID
# name	Title
# genre	Category
# year	Year Released
# imdb_rating	Rating

In [102]:
df = pd.read_csv('imdb.csv')

In [97]:
df.columns = [ 'ID', 'Title', 'Category', 'Year Released', 'Rating' ]

#max( df.year )

,ID,Title,Category,Year Released,Rating
0,1,Avatar,action,2009,7.9
1,2,Jurassic World,action,2015,7.3
2,3,The Avengers,action,2012,8.1
3,4,The Dark Knight,action,2008,9.0
4,5,Star Wars: Episode I - The Phantom Menace,action,1999,6.6
...,...,...,...,...,...
215,216,Hannibal,drama,2001,6.7
216,217,Catch Me If You Can,drama,2002,8.0
217,218,Big Daddy,drama,1999,6.4
218,219,Se7en,drama,1995,8.6
219,220,Seven,drama,1979,6.1

In [100]:
# You also can rename individual columns by using the .rename method. Pass a dictionary like the one below to the columns keyword argument

df = pd.DataFrame({
    'name': ['John', 'Jane', 'Sue', 'Fred'],
    'age': [23, 29, 21, 18]
})
df.rename(columns={
    'name': 'First Name',
    'age': 'Age'},
    inplace=True)

In [105]:
## Instruction
# If we didn’t know that df was a table of movie ratings, the column name might be confusing.

# To clarify, let’s rename name to movie_title.

# Use the keyword inplace=True so that you modify df rather than creating a new DataFrame!

reName =  { 'name' : 'movie_title' }

df.rename( columns=reName, inplace = True )

In [112]:
############# 
# Review

# Once more, you’ll be the data analyst for ShoeFly.com, a fictional online shoe store.

# More messy order data has been loaded into the variable orders. Examine the first 5 rows of the data using print and .head().

orders = pd.read_csv('shoefly.csv')
orders.head()

,id,first_name,last_name,gender,email,shoe_type,shoe_material,shoe_color
0,54791,Rebecca,Lindsay,female,RebeccaLindsay57@hotmail.com,clogs,faux-leather,black
1,53450,Emily,Joyce,female,EmilyJoyce25@gmail.com,ballet flats,faux-leather,navy
2,91987,Joyce,Waller,female,Joyce.Waller@gmail.com,sandles,fabric,black
3,14437,Justin,Erickson,male,Justin.Erickson@outlook.com,clogs,faux-leather,red
4,79357,Andrew,Banks,male,AB4318@gmail.com,boots,leather,brown

In [120]:
# Many of our customers want to buy vegan shoes (shoes made from materials that do not come from animals). Add a new column called shoe_source, which is vegan if the materials is not leather and animal otherwise.
orders['shoe_source'] = orders.apply(lambda row : 'vegan' if orders.shoe_material != 'leather' else 'animal' , axis = 1)

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [ ]:
orders